Tekla.Structures.DrawingInternal.LayoutOptions


Tekla.Structures.DrawingInternal.LayoutOptions.SetDrawingTypeAllowed(System.Int32,System.Boolean)


Tekla.Structures.DrawingInternal.LayoutOptions.GetDrawingTypeAllowed(System.Int32)


Tekla.Structures.DrawingInternal.LayoutOptions.SetOption(Tekla.Structures.DrawingInternal.LayoutOptionEnum,System.Int32)


Tekla.Structures.DrawingInternal.LayoutOptions.SetOption(Tekla.Structures.DrawingInternal.LayoutOptionEnum,System.String)


Tekla.Structures.DrawingInternal.LayoutOptions.SetOption(Tekla.Structures.DrawingInternal.LayoutOptionEnum,System.Double)


Tekla.Structures.DrawingInternal.LayoutOptions.GetOptionInt(Tekla.Structures.DrawingInternal.LayoutOptionEnum)


Tekla.Structures.DrawingInternal.LayoutOptions.GetOptionStr(Tekla.Structures.DrawingInternal.LayoutOptionEnum)


Tekla.Structures.DrawingInternal.LayoutOptions.GetOptionDouble(Tekla.Structures.DrawingInternal.LayoutOptionEnum)


Tekla.Structures.DrawingInternal.LayoutOptions.GetOptionType(Tekla.Structures.DrawingInternal.LayoutOptionEnum)


Tekla.Structures.DrawingInternal.LayoutOptions.DbOperationCommon(Tekla.Structures.DrawingInternal.QueryTypeEnum,Tekla.Structures.DrawingInternal.dotGrString_t,Tekla.Structures.DrawingInternal.dotGrString_t,Tekla.Structures.DrawingInternal.dotGrLayoutHandler_t@)


Tekla.Structures.DrawingInternal.LayoutOptions.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum,Tekla.Structures.DrawingInternal.dotGrString_t,Tekla.Structures.DrawingInternal.dotGrString_t,System.Boolean@)


Tekla.Structures.DrawingInternal.LayoutOptions.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum,Tekla.Structures.DrawingInternal.dotGrString_t,Tekla.Structures.DrawingInternal.dotGrString_t,System.Int32@)


Tekla.Structures.DrawingInternal.LayoutOptions.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum,Tekla.Structures.DrawingInternal.dotGrString_t,Tekla.Structures.DrawingInternal.dotGrString_t,Tekla.Structures.DrawingInternal.dotGrString_t@)


Tekla.Structures.DrawingInternal.LayoutOptions.DbOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum,Tekla.Structures.DrawingInternal.dotGrString_t,Tekla.Structures.DrawingInternal.dotGrString_t,System.Double@)
